#+BRAIN_PARENTS: system
#+TITLE: sm-emacs
#+auto_tangle: nil

A package for the management of Supermemo under Wine - interfaced via Emacs.

Features:

- Emacs integration by the following means:
  + Emacs and EXWM X-window/buffer management
    - Reliable named buffers navigate-able through EXWM
    - =display-buffer-alist= rules for SM windows; allowing for declarative window arrangement
    - ~Burly~ bookmarking of SM views
  + Text-streams via =exwm-input--fake-key= (utilizing ~Autohotkey~ as a backend) allowing for:
    - vIM-style modal bindings with NORMAL and Insert modes (EXWM).
    - Access to SM interface options as hydra-menus.
    - Item element editing in org buffers, with all markup converted back to HTML.
  + *Incremental video via mpv*, *org-media-protocol* and *org-protocol* links, allowing for:
    - ~lua~ and ~elisp~ based generation of gifs, extractions of subs, etc.
    - Link based extraction of time-stamps
    - Note-taking with ~org-mode~, scheduling with SM
  + *Incremental reading of PDFs* via ~org-noter~ and ~pdftools~

- Bridging functions between SMA, SM, and Emacs creating possibilities for:
  + Emacs completion-style fuzzy lookup of elements based on their element-id
  + Org-mode card building, much like [[https://github.com/louietan/anki-editor][anki-editor]]

** Key SuperMemo windows
:PROPERTIES:
:CREATED:  [2021-09-23 Thu 13:15]
:ID:       523441d5-46f3-45e4-9900-c9ce786dd9f7
:END:

We'll start with the outlier first as its the most important window. Normally, SuperMemo will start with the first scheduled item of the day loaded into the elements window. The element name bleeds into the =WM_TITLE= variable and since we can't predict which element would be presented first on any given day, we will have to use a work around to get a stable title.

The following makes use of Supermemo's ability to set a constant element via the bla bla menu. While this was originally intended to display quotes or the like it works nicely for us as the same text will be shown via =WM_TITLE= and by extension by in the =exwm-title= variable.
Besides, Emacs can be rigged to have this kind of functionality at startup and perform it even better.

Here I use =home= as the only text in the element body, but you can use whatever you like. I've written the hooks in such a way that the buffer-name will remain constant even after progressing past this initial home element.

#+name: element-window-rx
#+begin_src elisp
(rx bol "home" eol)
#+end_src

#+RESULTS: element-window-rx
: ^home$

#+NAME: element-data-rx
#+begin_src elisp
(rx
 (|
  (seq (or "Topic" "Element") space "#" (one-or-more digit) ":")
  (seq "Element data")))
#+end_src

Next capture the knowledge tree:
"X:sm18.exe/neuron"
#+NAME: knowledge-tree-rx
#+begin_src elisp
(rx bol "neuron" eol)
#+end_src

#+RESULTS: knowledge-tree-rx
: ^neuron$

We'll also attempt to suppress the empty(?) buffer created by Supermemo.
This seems to be a frame made for SM.
#+NAME: empty-sm-frame-rx
#+begin_src elisp
(regexp-quote "z:\\home\\nanjigen\\documents\\sm")
#+end_src

#+RESULTS: empty-sm-frame-rx
: z:\\home\\vrika\\documents\\sm

Now we'll throw this together as a set of buffer rules:

** TODO Try get ~input-fake-key~ working with Wine
:PROPERTIES:
:CREATED:  [2020-12-08 Tue 15:05]
:ID:       733fbf64-129d-4b63-8b92-8fcc569c5627
:END:

Testing some elisp functions to convert Windows paths from Wine to Linux
#+begin_src elisp :tangle no
(defun my-translate-winpath ()
  "change :C\win\path to 'nix /path/path"
  (let ((path (current-kill 0 'do-not-move)))
    (shell-command-to-string (format "~/.scripts/winpath.sh %s" path))))

(defun my-translate-winpath ()
  "change :C\win\path to 'nix /path/path"
  (let ((path (current-kill 0 'do-not-move)))
    (my-translate-path)))

(defun my-translate-winpath ()
  (interactive)
  (let* ((path (s-chop-prefix "z:" (current-kill 0 'do-not-move)))
         (nixpath (s-replace "\\" "/" path))
         (path1 (s-replace "documents" "Documents" nixpath)))
    (s-replace "sm" "SM" path1)))
#+end_src

Let's test this with Xdotool. It works, but isn't reliable.
#+begin_src elisp :tangle no
(defun sm-exwm-core-test ()
  "Send string to a given exwm buffer"
  (interactive)
(progn)
(my-translate-winpath)
;; (sit-for 3)
(message sm-path-nix))

(defun sm-exwm-core-test ()
  "Send string to a given exwm buffer"
  (interactive)
  ;; (shell-command "sh ~/.scripts/xdotool/get_element_path.sh"))
  (shell-command "sh ~/.scripts/xdotool/get_element_path.sh"))

(defun sm-exwm-core-test ()
  "Send string to a given exwm buffer"
  (interactive)
(progn
  (shell-command "sh ~/.scripts/xdotool/get_element_path.sh")
  (gui--selection-value-internal 'CLIPBOARD)))

(defun sm-exwm-core-test ()
  "Send string to a given exwm buffer"
  (interactive)
  (shell-command "sh ~/.scripts/xdotool/get_element_path.sh")
(lambda ()
)
  (setq sm-path (gui--selection-value-internal 'CLIPBOARD)))
  ;; (shell-command "sh ~/.scripts/xdotool/get_element_path.sh"))
#+end_src

Testing with EXWM functionality (elisp only).
The big issue here is that control keys are not passed on to the Wine application. However, they are when using ~exwm-input-send-next-key~.
#+begin_src elisp :tangle no
(defun sm-exwm-core-test()
  "test"
  (interactive)
  ;; (exwm--log)
  ;; (let ((exwm-input-line-mode-passthrough t))
         ;; (key "?/C-v"))
         ;; (key (read-key "22")))
    (exwm-input--fake-key ("?/C-s-o")))

(exwm-input-set-key (kbd "<f9>") #'sm-exwm-core-test)


;;;###autoload
(defun sm-exwm-core-test ()
  "Move down."
  (interactive)
  (let ((exwm-input-line-mode-passthrough t))
    (exwm-input--fake-key 'left)))
#+end_src

#+RESULTS:

Try and get the right key code
#+begin_src elisp :tangle no
;; (read-key)
(vector "v")
#+end_src

#+RESULTS:
: ["? C-v"]

Trying the same but with a string.
#+begin_src elisp :tangle no
(defun my-exwm-send-string (string)
  "Send STRING to `exwm-mode' buffer or just insert it."
  (if (eq major-mode 'exwm-mode)
      (mapc #'exwm-input--fake-key (string-to-list string))
    (insert string)))

(defun sm-exwm-core-string-test ()
  (interactive)
  ;; (let ((exwm-input-line-mode-passthrough t))
    ;; (my-exwm-send-string [#o26])))
  (my-exwm-send-string [94 3]))

;; (term-send-raw-string "l")

;; (read-key-sequence-vector)

(exwm-input-set-key (kbd "<f9>") #'sm-exwm-core-string-test)
;; ###autoload
;; (defun sm-exwm-core-test ()
;;   "Send string to a given exwm buffer"
;;   (interactive)
;;   (my-exwm-send-string "sm-get-path ")
;;   (find-file (my-translate-winpath)))
#+end_src

Try with this
#+begin_src elisp :tangle no
(cl-defun exwm-input-send-sim-key (key)
  "Fake a key event according to the last input key sequence."
  (interactive)
  (exwm--log)
  (unless (derived-mode-p 'exwm-mode)
    (cl-return-from exwm-input-send-simulation-key))
  (let ((keys (gethash (this-single-command-keys)
                       exwm-input--simulation-keys)))
    (dolist (key keys)
      (exwm-input--fake-key key))))
#+end_src

#+begin_src elisp :tangle no
(cl-defun my-exwm-input-send-next-key (keys)
  "Send next key to client window.

EXWM will prompt for the key to send.  This command can be prefixed to send
multiple keys.  If END-KEY is non-nil, stop sending keys if it's pressed."
  (interactive "p")
  (exwm--log)
  (unless (derived-mode-p 'exwm-mode)
    (cl-return-from my-exwm-input-send-next-key))
  (let (key keys)
      ;; Skip events not from keyboard
      (let ((exwm-input-line-mode-passthrough t))
            ;; (setq key (read-key (format (key-description keys))
        (setq key (key-description "?\C-v")))
      (setq keys (vconcat keys (vector key)))
      (exwm-input--fake-key key)))
#+end_src

#+begin_src elisp :tangle no
(defun sm-exwm-core-test()
  "test"
  (interactive)
  (exwm/enter-char-mode)
  (exwm-input--fake-key ?\C-v))

  ;; (exwm-input-release-keyboard)
(defun sm-exwm-core-test ()
  "Copy text."
  (interactive)
  (exwm-input--invoke--m))
(exwm-input-invoke-factory "m")

;;;###autoload
(defun sm-exwm-core-copy ()
  "Copy text."
  (interactive)
  (exwm-input--fake-key ?\C-c))

#+end_src

** fs monitoring
:PROPERTIES:
:CREATED:  [2021-09-19 Sun 17:46]
:ID:       503009e6-6543-471d-b7a7-0bcfdf90aa94
:END:

Using =inotifywait= from the ~inotif-tools~ program we can watch the =$SM-COLLECTION/elements= folder recursively for file open events made by SuperMemo:
#+begin_src elisp :tangle sm-sentinel.el
;;; desktop/exwm/+sm-sentinel.el -*- lexical-binding: t; -*-

(defun sm-element-inotify-process ()
  "Watch for reads of element files in the collection dir"
  (interactive)
  (start-process
   "inotifywait"
   "*inotifywait*"
   "inotifywait" "-mrq" "-e" "open" "/home/nanjigen/Documents/SM/neuron/elements" "--include" ".HTM"))

#+end_src

And to watch image access:
#+begin_src elisp :tangle sm-sentinel.el
(defun sm-image-inotify-process ()
  "Watch for reads of image files in the collection dir"
  (interactive)
  (start-process
   "inotifywait-image"
   "*inotifywait-image*"
   "inotifywait" "-mrq" "-e" "open" "/home/nanjigen/Documents/SM/neuron/elements" "--include" "\.(jpg|gif|png|svg)"))
#+end_src

#+RESULTS:
: #<process inotifywait>

Setup a sentinel to watch for changes to the process buffer =*inotifywait*=
This is mostly for testing purposes
#+begin_src elisp :tangle sm-sentinel.el
(defun msg-me (process event)
  (princ
   (format "Process: %s had the event '%s'" process event)))
(set-process-sentinel (get-process "inotifywait") 'msg-me)

#+end_src

The function below captures all the paths outputted from the ~inotifywait~ process as seperate symbols in a single list. This is then transferred to a holding variable of the same make-up, and the original list is emptied. This way, on every file read when an element is accessed by SuperMemo, only those file paths are kept in the variable, instead of appending each new file found to the list.
#+begin_src elisp :tangle sm-sentinel.el
(defun keep-output (process output)
  "Store the paths of elements caught by inotify"
  (progn
    (setq captured-path (cons output captured-path))
    (sleep-for 0.1)
    (list-sm-element-paths)
    (setq captured-path nil)))

(defun keep-image-path (process output)
  "Store the paths of elements caught by inotify"
  (progn
    (setq captured-image-path (cons output captured-image-path))
    (sleep-for 0.1)
    (setq image-file-list (s-lines (s-replace " OPEN " "" (car captured-image-path))))
    (setq captured-image-path nil)))

#+end_src

#+begin_src elisp :tangle sm-sentinel.el
(defvar captured-image-path nil
  "The path captured by the inotify sentinel")

(defvar captured-path nil
  "The path captured by the inotify sentinel")

#+end_src

The below is some logic for determining if what was captured is a Topic or an element pair such as Q/A or a cloze. It then stores the path values as such.

#+begin_src elisp :tangle sm-sentinel.el
(defun list-sm-element-paths ()
  "Text munge captured paths"
  (setq sm-file-list (s-lines (s-replace " OPEN " "" (car captured-path))))
  (interactive)
  (if (> (length sm-file-list) 1)
      (progn
        (setq sm-element-item-p t)
        (setq sm-element-article-p nil))
    (progn
      (setq sm-element-item-p nil)
      (setq sm-element-article-p t))))

#+end_src

#+begin_src elisp :tangle sm-sentinel.el
(defvar sm-element-item-p nil
  "Whether currently viewed element is an item.")

(defvar sm-element-article-p nil
  "Whether currently viewed element is an article")

#+end_src

Get process and set sentinels:
#+begin_src elisp

(set-process-filter (get-process "inotifywait") 'keep-output)
(set-process-filter (get-process "inotifywait-image") 'keep-image-path)

#+end_src

#+begin_src elisp
(process-sentinel (get-process "inotifywait"))
#+end_src

Edit files:
#+begin_src elisp
(defun edit-component-as-org ()
  (interactive)
  (if sm-element-item-p t
    (let ((question (nth 0 file-list))
          (answer (nth 1 file-list)))
      (find-file question))))

#+end_src

Then we can parse these file read through to various =setq's= to be read in the background.

** sm launcher
:PROPERTIES:
:CREATED:  [2021-09-20 Mon 07:42]
:ID:       eec68fe9-9dc3-4591-9047-af0e4ea196b4
:END:

The wineprefix and drive_c should be named ~$PATHS~
#+begin_src elisp :tangle sm-emacs-protocol.el
(defun nanjigen/launch-sm-process ()
  "Launch SM as a process with 'start-process-shell-command'"
  (interactive)
  (start-process
   "SuperMemo18"
   "*Supermemo18*"
   (combine-and-quote-strings '("env WINEPREFIX="
                                "/home/nanjigen/.local/share/wineprefixes/supermemo18"
                                " LANG="
                                "ja_JP.utf8" ;; this is required to pass links containing CJK characters to org-protocol - TODO need a work around
                                " wine "
                                "/home/nanjigen/.local/share/wineprefixes/supermemo18/drive_c/SuperMemo/sm18.exe"
                                "") "\"")))

#+end_src

We have another ~wine~ process run this way for testing purposes:
#+begin_src elisp :tangle sm-emacs-protocol.el
(defun nanjigen/launch-notepad-process ()
  "Launch notepad as a process with 'start-process-shell-command'
this is used for testing purposes"
  (interactive)
  (start-process-shell-command
   "Notepad"
   "*notepad.exe*"
   (combine-and-quote-strings '("env WINEPREFIX="
                                "/home/nanjigen/.local/share/wineprefixes/supermemo18"
                                " wine "
                                "notepad.exe"
                                "") "\"")))

#+end_src

#+begin_src elisp
(process-list)
#+end_src

#+RESULTS:
| SuperMemo18 | *Guix Internal REPL* | Guile REPL | vterm | *bash-completion* | XELB | epdfinfo | server |

#+begin_src elisp
;; (process-command (get-process "SuperMemo18"))
;; (alist-get 'comm (process-attributes
;;                   (process-id (get-process "SuperMemo18"))))
;; (process-id (get-process "SuperMemo18"))
;; (get-process "SuperMemo18")
;; (process-name (get-process "SuperMemo18"))
;; (let* ((child-procs (alist-get 'comm (process-attributes 3335)))
;;        ()))
(process-attributes (process-id (get-process "SuperMemo18")))

;; (exwm--update-class 3335)
;; (exwm--id->buffer 8178896)
#+end_src

#+RESULTS:
: ((args . /home/nanjigen/.local/share/wineprefixes/supermemo18/drive_c/SuperMemo/sm18.exe) (pmem . 0.9888432805055687) (pcpu . 0.5553476355470778) (etime 0 828 310000 0) (rss . 97864) (vsize . 2725560) (start 24910 33423 939463 133000) (thcount . 4) (nice . 0) (pri . 20) (ctime 0 0 0 0) (cstime 0 0 0 0) (cutime 0 0 0 0) (time 0 4 600000 0) (stime 0 1 450000 0) (utime 0 3 150000 0) (cmajflt . 0) (cminflt . 228) (majflt . 16202) (minflt . 68015) (tpgid . 3806) (ttname . /dev/pts0) (sess . 3806) (pgrp . 3806) (ppid . 22545) (state . S) (comm . sm18.exe) (group . users) (egid . 998) (user . nanjigen) (euid . 1000))

#+begin_src sh
guix install dotnet@3
#+end_src

#+RESULTS:

#+begin_src sh
# xprop -id 3806
# pgrep sm18.exe
# xdotool search --pid 3806
# xdotool search --pid 3335 -- set_window --class sm18
xdotool search --name home

#+end_src
#+RESULTS:

81788961

* AHK
:PROPERTIES:
:CREATED:  [2020-11-30 Mon 17:08]
:ID:       8d766356-bb00-4536-8974-6906b6c2837f
:END:

A good guide for ahk under linux https://code.google.com/archive/p/winetricks/wikis/AutoHotkey.wiki
#+begin_src ahk :tangle ~/.scripts/ahk/activate.verb :mkdirp yes
w_metadata activate apps \
title="Hello, Autohotkey"

load_activate()
{
w_ahk_do "
;WinActivate, ahk_class TElWind
;#IfWinActive, ahk_class, TElWind
run, notepad.exe
WinWait, Untitled - Notepad
;ControlSend, lol, Test, ahk_class TElWind
;ControlSend, Test2, {v}, ahk_class TElWind
;#IfWinActive, ahk_class, TElWind
;j::
;WinActivate, ahk_exe sm18.exe
;WinGetActiveTitle, Title
;WinGetClass, Var, A
;MsgBox ahk_class %Var%
;MsgBox, The active window is "%Title%".
send, l
;return
"
}
#+end_src

Finding the class of a window
#+begin_src ahk :tangle ~/.scripts/ahk/class.verb :mkdirp yes
w_metadata class apps \
title="Hello, Autohotkey"

load_class()
{
w_ahk_do "
j::
;WinActivate, ahk_class TElWind
;#IfWinActive, ahk_class, TElWind
;WinActivate, ahk_class sm18.exe
WinGetActiveTitle, Var
;WinGetClass, Var, A
;ControlGet, Var, A
;MsgBox ahk_class %Var%
MsgBox, The active window is "%Var%".
;send, l
return
"
}
#+end_src

Testing some sending code
#+begin_src ahk :tangle ~/.scripts/ahk/send.verb :mkdirp yes
w_metadata send apps \
title="Hello, Autohotkey"

load_send()
{
w_ahk_do "
;j::
;WinActivate, ahk_class TElWind
;#IfWinActive, ahk_class, TElWind
;#IfWinActive, ahk_class, Notepad
;ControlSend, Edit1, Test, WinTitle, Untitled - Notepad
;ControlSend, Edit1, Test, Untitled - Notepad
ControlSend, Edit1, Test, home
;WinGetActiveTitle, Var
;WinGetClass, Var, A
;MsgBox ahk_class %Var%
;MsgBox, The active window is "%Var%".
;send, l
;return
"
}
#+end_src

This works well for copying the element path
#+begin_src ahk :tangle ~/.scripts/ahk/senda.verb :mkdirp yes
w_metadata senda apps \
title="Hello, Autohotkey"

load_senda()
{
w_ahk_do "
#NoEnv  ; Recommended for performance and compatibility with futur§e AutoHotkey releases.
; #Warn  ; Enable warnings to assist with detecting common errors.
SendMode Input  ; Recommended for new scripts due to its superior speed and reliability.
;SetWorkingDir %A_ScriptDir%  ; Ensures a consistent starting directory.
SetTitleMatchMode,2
;WinActivate, ahk_exe sm18.exe
;WinWaitActive, ahk_exe sm18.exe
;WinActivate, ahk_class TElWind
;WinWaitActive, WinTitle Untitled - Notepad
#IfWinActive, ahk_class TElWind

::sm-get-path::
send, +{F10}
;sleep,5
send, f
;sleep,5
send, c
;send, ^a
"
}
#+end_src
z:\\home\\vrika\\documents\\sm\\neuron\\elements\\16\\168.HTM
z:\home\vrika\documents\sm\neuron\elements\16\168.HTM
file:/home/vrika/Documents/SM/neuron/elements/16/167.HTM

Change windows path to unix:

#+begin_src elisp
;; (defun my-translate-winpath ()
  ;; (interactive)
  ;; "change :C\win\path to 'nix /path/path"
  (let ((path (current-kill 0 'do-not-move)))
    (shell-command-to-string (format "~/.scripts/winpath.sh %s" path)))
#+end_src

#+begin_src elisp
(defun my-translate-winpath ()
  (interactive)
  (progn
  ;; (shell-command "sh ~/.scripts/xdotool/get_element_path.sh")
  (shell-command "xclip -sel clip -o")
  (shell-command "xdotool sleep 0.2 key --delay 50 Shift+F10+f+c")
;; (gui--selection-value-internal 'CLIPBOARD)
  (setq sm-path (gui--selection-value-internal 'CLIPBOARD))
    (let* ((path1 (s-chop-prefix "z:" sm-path))
           (nixpath (s-replace "\\" "/" path1))
           (docpath (s-replace "documents" "Documents" nixpath))
           (finpath (s-replace "sm" "SM" docpath)))
      (setq sm-path-nix finpath))))
;; (list path path2)
;; (shell-command-to-string (format "~/.scripts/winpath.sh" ))
#+end_src

#+RESULTS:
: my-translate-winpath

#+begin_src elisp
(defun sm-exwm-core-test ()
  "Send string to a given exwm buffer"
  (interactive)
  (my-exwm-send-string "sm-get-path ")
  (sit-for 0.3)
  (let ((path (my-translate-winpath)))
    (find-file path)))
#+end_src

#+RESULTS:
: my-translate-winpath

#+begin_src elisp
(defun my-exwm-send-string (string)
  "Send STRING to `exwm-mode' buffer or just insert it."
  (if (eq major-mode 'exwm-mode)
      (mapc #'exwm-input--fake-key (string-to-list string))
    (insert string)))
#+end_src
z:\home\vrika\documents\sm\neuron\elements\5.HTM
#+RESULTS:
: my-exwm-send-string

#+begin_src elisp
;; (subst-char-in-string ?\ ?/ (regexp-quote "\home"))
;; (regexp-quote "^home")
;; (convert-standard-filename "z:\home\vrika\documents\sm\neuron\elements\16\168.HTM")
;; (setq windows-path (unescape-windows-path "\home\vrika"))

;; (setq windows-path1 "\home\vrika")
;; (wsl-path-convert-file-name "\home\vrika")
;; (s-replace "\\" "/" "\home")
;; (s-replace "\\" "/" windows-path)
;; (replace-regexp-in-string "\\\\" "\\\\\\\\" "\home\vrika")
;; (message windows-path1)
;; (defun unescape-windows-path (pth)
;;   ;; (interactive "*sWindows path:")
;;    (replace-regexp-in-string "\\\\" "\\\\\\\\" pth))

;; (defun paste-windows-path (pth)
;;   (interactive "*sWindows path:")
;;   (insert
;;    (replace-regexp-in-string "\\\\" "\\\\\\\\" pth)))
;; (message (current-kill 0 'do-not-move))
;; (shell-command-to-string "sed -e 's#^J:##' -e 's#\\#/#g' <<< 'test'")

(convert-standard-filename "~/Documents")
#+end_src

#+RESULTS:
: ~/Documents

#+begin_src sh :tangle ~/.scripts/winpath.sh
function winpath(){
    line=$(sed -e 's#^J:##' -e 's#\\#/#g' <<< "$1")
    echo "$line"
}
#+end_src

#+begin_src sh
#!/bin/bash
clip=$(xclip -selection c -o)
line=$(sed -e 's#^z:##' -e 's#\\#/#g' <<< "$clip")
echo "$line"
#+end_src

#+RESULTS:

#+begin_src ahk :tangle ~/.scripts/ahk/hotstring.verb :mkdirp yes
w_metadata hotstring apps \
title="Hello, Autohotkey"

load_hotstring()
{
w_ahk_do "
:*:get::get it boi
"
}
#+end_src

#+begin_src sh :dir ~/.scripts/ahk/ :session test
env WINEPREFIX=/home/vrika/.local/share/wineprefixes/supermemo18 winetricks activate.verb
#+end_src

#+RESULTS:
|                                              |               |                       |                                     |            |                                                                  |        |          |     |                |
| Executing                                    | mkdir         | -p                    | /home/vrika/.local/share/wineprefixes |            |                                                                  |        |          |     |                |
| Using                                        | winetricks    | 20200412              | -                                   | sha256sum: | 40ff4c67804584b73d4d36153e1f64ca426d739f1790bd748f5ded0865e8cc7f | with   | wine-5.2 | and | WINEARCH=win32 |
| Executing                                    | w_do_call     | activate              |                                     |            |                                                                  |        |          |     |                |
| Executing                                    | mkdir         | -p                    | /home/vrika/.local/share/wineprefixes |            |                                                                  |        |          |     |                |
| Executing                                    | load_activate |                       |                                     |            |                                                                  |        |          |     |                |
| Executing                                    | wine          | x:\ahk\AutoHotkey.exe | C:\windows\Temp\activate.ahk        |            |                                                                  |        |          |     |                |
| 00b9:fixme:keyboard:X11DRV_GetKeyboardLayout | couldn't      | return                | keyboard                            | layout     | for                                                              | thread |       81 |     |                |

